app/Services/CheckoutService.php

SELECT *, tbl_sanpham.fGiaBanLe * (1 - IFNULL(tbl_khuyenmai.fChietKhau/100, 0)) as total_price
FROM `tbl_sanpham`
LEFT JOIN `tbl_sp_km` ON `tbl_sp_km`.`FK_iMaSP` = `tbl_sanpham`.`PK_iMaSP`
LEFT JOIN `tbl_khuyenmai` ON `tbl_khuyenmai`.`PK_iMaKM` = `tbl_sp_km`.`FK_iMaKM`
WHERE `tbl_sanpham`.`PK_iMaSP` = '44'
 LIMIT 1
---
    public function get1Product($id)
    {
        $result = $this->product
            ->select('*, tbl_sanpham.fGiaBanLe * (1 - IFNULL(tbl_khuyenmai.fChietKhau/100, 0)) as total_price')
            ->join('tbl_sp_km', 'tbl_sp_km.FK_iMaSP = tbl_sanpham.PK_iMaSP', 'left')
            ->join('tbl_khuyenmai', 'tbl_khuyenmai.PK_iMaKM = tbl_sp_km.FK_iMaKM', 'left')
            ->where('tbl_sanpham.PK_iMaSP', $id)
            ->first();