app/Services/HomeService.php

    public function getAllSellingProducts()
    {
        $result = $this->product
            ->select('tbl_sanpham.PK_iMaSP, tbl_sanpham.sTenSP, tbl_sanpham.sDVT, tbl_sanpham.fGiaBanLe,tbl_sanpham.fSoLuong, tbl_sanpham.sHinhAnh, tbl_sanpham.sGhiChu, count(tbl_ctdondathang.FK_iMaSP) as soluong')
            ->join('tbl_ctdondathang', 'tbl_ctdondathang.FK_iMaSP = tbl_sanpham.PK_iMaSP')
            ->groupBy('FK_iMaSP')
            ->orderBy('soluong', 'desc')
            ->findAll();
---
SELECT `tbl_sanpham`.`PK_iMaSP`, `tbl_sanpham`.`sTenSP`, `tbl_sanpham`.`sDVT`, `tbl_sanpham`.`fGiaBanLe`, `tbl_sanpham`.`fSoLuong`, `tbl_sanpham`.`sHinhAnh`, `tbl_sanpham`.`sGhiChu`, count(tbl_ctdondathang.FK_iMaSP) as soluong
FROM `tbl_sanpham`
JOIN `tbl_ctdondathang` ON `tbl_ctdondathang`.`FK_iMaSP` = `tbl_sanpham`.`PK_iMaSP`
GROUP BY `FK_iMaSP`
ORDER BY `soluong` DESC

            } else {
                //Kiểm tra tồn tại sản phẩm này trong giỏ hàng hay chưa
                $magiohang = $this->cart->select('PK_iMaGH')->where('FK_iMaTK', $id)->first();
                $duplicateCart = $this->cartDetail
                    ->join('tbl_giohang', 'tbl_giohang.PK_iMaGH = tbl_ctgiohang.FK_iMaGH')
                    ->where('tbl_ctgiohang.FK_iMaSP', $dataSave_CTGH_new['FK_iMaSP'])
                    ->where('tbl_giohang.FK_iMaTK', $id)
                    ->first();
---
SELECT *
FROM `tbl_ctgiohang`
JOIN `tbl_giohang` ON `tbl_giohang`.`PK_iMaGH` = `tbl_ctgiohang`.`FK_iMaGH`
WHERE `tbl_ctgiohang`.`FK_iMaSP` = '1'
AND `tbl_giohang`.`FK_iMaTK` = '4'
 LIMIT 1