app/Services/ProductService.php

    public function getAllProduct()
    {
        $result = $this->product
            ->select('*')
            ->join('tbl_nhomsanpham', 'tbl_nhomsanpham.PK_iMaNhom  = tbl_sanpham.FK_iMaNhom')
            ->findAll();
---
SELECT *
FROM `tbl_sanpham`
JOIN `tbl_nhomsanpham` ON `tbl_nhomsanpham`.`PK_iMaNhom`  = `tbl_sanpham`.`FK_iMaNhom`