app/Services/ReturnBillService.php

SELECT *
FROM `tbl_ctphieuhoantra`
JOIN `tbl_sanpham` ON `tbl_sanpham`.`PK_iMaSP` = `tbl_ctphieuhoantra`.`FK_iMaSP`
WHERE `FK_iMaPhieu` = 'HT_16992845585333'
---
    public function getReturnBillDetailById($id)
    {
        $result = $this->returnBillDetail
            ->select('*')
            ->join('tbl_sanpham', 'tbl_sanpham.PK_iMaSP = tbl_ctphieuhoantra.FK_iMaSP', 'inner')
            ->where('tbl_ctphieuhoantra.FK_iMaPhieu', $id)
            ->findAll();