app/Services/StatisticalService.php

SELECT *
FROM `tbl_sanpham`
JOIN `tbl_nhomsanpham` ON `tbl_nhomsanpham`.`PK_iMaNhom` = `tbl_sanpham`.`FK_iMaNhom`
---
    public function inventoryProduct()
    {
        $result = $this->product
            ->select('*')
            ->join('tbl_nhomsanpham', 'tbl_nhomsanpham.PK_iMaNhom = tbl_sanpham.FK_iMaNhom')
            ->findAll();