app/Services/StatisticalService.php

SELECT *
FROM `tbl_dondathang`
LEFT JOIN `tbl_nhanvien` ON `tbl_nhanvien`.`PK_iMaNV` = `tbl_dondathang`.`FK_iMaNV`
JOIN `tbl_khachhang` ON `tbl_khachhang`.`PK_iMaKH` = `tbl_dondathang`.`FK_iMaKH`
JOIN `tbl_trangthai` ON `tbl_trangthai`.`PK_iMaTrangThai` = `tbl_dondathang`.`FK_iMaTrangThai`
SELECT SUM(tbl_sanpham.fGiaBanLe * tbl_ctdondathang.iSoLuong) as tong
FROM `tbl_dondathang`
JOIN `tbl_ctdondathang` ON `tbl_ctdondathang`.`FK_iMaDon` = `tbl_dondathang`.`PK_iMaDon`
JOIN `tbl_sanpham` ON `tbl_sanpham`.`PK_iMaSP` = `tbl_ctdondathang`.`FK_iMaSP`
 LIMIT 1
---
    public function getTotalAll(){
        $result = $this->order
        ->select('SUM(tbl_sanpham.fGiaBanLe * tbl_ctdondathang.iSoLuong) as tong')
        ->join('tbl_ctdondathang', 'tbl_ctdondathang.FK_iMaDon = tbl_dondathang.PK_iMaDon')
        ->join('tbl_sanpham', 'tbl_sanpham.PK_iMaSP = tbl_ctdondathang.FK_iMaSP')
        // ->groupBy('tbl_ctdondathang.FK_iMaDon')
        ->first();

SELECT *
FROM `tbl_sanpham`
JOIN `tbl_nhomsanpham` ON `tbl_nhomsanpham`.`PK_iMaNhom` = `tbl_sanpham`.`FK_iMaNhom`
---
    public function inventoryProduct()
    {
        $result = $this->product
            ->select('*')
            ->join('tbl_nhomsanpham', 'tbl_nhomsanpham.PK_iMaNhom = tbl_sanpham.FK_iMaNhom')
            ->findAll();

SELECT *
FROM `tbl_sanpham`
JOIN `tbl_nhomsanpham` ON `tbl_nhomsanpham`.`PK_iMaNhom` = `tbl_sanpham`.`FK_iMaNhom`
WHERE `tbl_sanpham`.`PK_iMaSP` = '49'
---
    public function inventoryProductByCode($id)
    {
        $result = $this->product
            ->select('*')
            ->join('tbl_nhomsanpham', 'tbl_nhomsanpham.PK_iMaNhom = tbl_sanpham.FK_iMaNhom')
            ->where('tbl_sanpham.PK_iMaSP', $id)
            ->findAll();