app/Controllers/BaseController.php

    public function loadMasterLayoutUser($data, $title, $content, $dataLayout = [])
    {
        $db      = \Config\Database::connect(); // Khởi tạo kết nối đến cơ sở dữ liệu

        //Lấy danh sách nhóm sản phẩm
        $tbl_nhomsanpham = $db->table('tbl_nhomsanpham');
        $query = $tbl_nhomsanpham->get();
        $dataHeader['groups'] = $query->getResultArray();

        //Lấy danh sách khuyến mãi
        $tbl_khuyenmai = $db->table('tbl_khuyenmai');
        $query = $tbl_khuyenmai->get();
        $dataHeader['promotions'] = $query->getResultArray();

        //Lấy danh sách khuyến mãi trong tháng hiện tại
        $tbl_khuyenmai = $db->table('tbl_khuyenmai');
        $month = date('m'); // Lấy tháng hiện tại
        $year = date('Y');  // Lấy năm hiện tại
        $query = $tbl_khuyenmai->where('MONTH(dNgayHieuLuc)', $month)
            ->where('YEAR(dNgayHieuLuc)', $year)
            ->get();
        $dataHeader['promotionMonths'] = $query->getResultArray();


        //Lấy danh sách sản phẩm trong giỏ hàng theo id tài khoản
        $tbl_sanpham = $db->table('tbl_sanpham');
        $tbl_chitietgiohang = $db->table('tbl_ctgiohang');
        $tbl_giohang = $db->table('tbl_giohang');
        $idTaiKhoan = 4; // Thay thế bằng id tài khoản thực tế
        $query = $tbl_sanpham->select('tbl_sanpham.*, tbl_ctgiohang.*, tbl_giohang.*')
            ->join('tbl_ctgiohang', 'tbl_ctgiohang.FK_iMaSP = tbl_sanpham.PK_iMaSP')
            ->join('tbl_giohang', 'tbl_giohang.PK_iMaGH = tbl_ctgiohang.FK_iMaGH')
            ->where('tbl_giohang.FK_iMaTK', $idTaiKhoan)
            ->limit(5)
            ->get();
---
SELECT *
FROM `tbl_nhomsanpham`
SELECT *
FROM `tbl_khuyenmai`
SELECT *
FROM `tbl_khuyenmai`
WHERE MONTH(dNgayHieuLuc) = '11'
AND YEAR(dNgayHieuLuc) = '2023'
SELECT `tbl_sanpham`.*, `tbl_ctgiohang`.*, `tbl_giohang`.*
FROM `tbl_sanpham`
JOIN `tbl_ctgiohang` ON `tbl_ctgiohang`.`FK_iMaSP` = `tbl_sanpham`.`PK_iMaSP`
JOIN `tbl_giohang` ON `tbl_giohang`.`PK_iMaGH` = `tbl_ctgiohang`.`FK_iMaGH`
WHERE `tbl_giohang`.`FK_iMaTK` = 4
 LIMIT 5